In [2]:
print('hello world ')

hello world

In [3]:
import numpy as np
import pandas as pd

In [4]:
dict1={
    "name":['harry','rohan','shawon'],
    "marks":[92,34,24],
    "city":['rampur','kolkata','new york',]
}

In [5]:
df=pd.DataFrame(dict1)
#its use to basically analyze big data 
#it covert in data frame in

In [6]:
df

     name  marks      city
0   harry     92    rampur
1   rohan     34   kolkata
2  shawon     24  new york

In [7]:
###covert in csv this data frame

In [8]:
df.to_csv('friends.csv')
#it create a excel shit in this data frame which is given on the index
#with index and column give it 
#it also include index

In [9]:
#we can see without index
df.to_csv('friends_index_false.csv',index=False)

In [10]:
#if the data is so big 
#if we want to see only first 2 row 
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [11]:
#if we want to see 2nd two row
df.tail(2)

     name  marks      city
1   rohan     34   kolkata
2  shawon     24  new york

In [12]:
df.describe()#details tells us about this csv

          marks
count   3.00000
mean   50.00000
std    36.71512
min    24.00000
25%    29.00000
50%    34.00000
75%    63.00000
max    92.00000

In [13]:
arman=pd.read_csv('arman.csv')#creat a new csv file which is read in 
#this method
arman

,Unnamed: 0.5,Unnamed: 0.4,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,location,city,country
0,0,0,0,0,0,0,gazipur,usa,Bangladesh
1,1,1,1,1,1,1,newmarket,nilkhet,dhaka
2,2,2,2,2,2,2,uttara,azompur,dhaka

In [14]:
arman['location']#we only see the location

0      gazipur
1    newmarket
2       uttara
Name: location, dtype: object

In [15]:
#change specific  value in this 
arman['city'][0]='usa'
arman

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_9400\2052056910.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  arman['city'][0]='usa'
C:\Users\Lenovo\AppData\Local\Temp\ipykernel_9400\2052056910.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  arman['city'][0]='usa'

,Unnamed: 0.5,Unnamed: 0.4,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,location,city,country
0,0,0,0,0,0,0,gazipur,usa,Bangladesh
1,1,1,1,1,1,1,newmarket,nilkhet,dhaka
2,2,2,2,2,2,2,uttara,azompur,dhaka

In [16]:
#in this above code 0 index we change the city name 
#Dhaka to usa we want to save this modify in arman.csv file 
arman.to_csv('arman.csv')

In [17]:
#series and dataframe
ser=pd.Series(np.random.rand(34))
#it gives us a series 0 to 34

In [18]:
ser

0     0.594607
1     0.866818
2     0.911488
3     0.875431
4     0.588774
5     0.710787
6     0.992510
7     0.321160
8     0.937874
9     0.155446
10    0.729229
11    0.717309
12    0.606304
13    0.224171
14    0.155424
15    0.007774
16    0.203438
17    0.678406
18    0.915160
19    0.062974
20    0.125262
21    0.752429
22    0.455963
23    0.793614
24    0.501243
25    0.187136
26    0.462497
27    0.713243
28    0.586150
29    0.314286
30    0.624380
31    0.936142
32    0.505350
33    0.587003
dtype: float64

In [19]:
type(ser)#its a series 
#its a data structure in pandas

pandas.core.series.Series

In [20]:
#create a dataframe 
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))
newdf.head()
#without head()it print all dataframe which has 334 rows and 5 column
newdf

            0         1         2         3         4
0    0.141125  0.613454  0.934262  0.351210  0.190514
1    0.076875  0.333627  0.696435  0.087534  0.325118
2    0.137903  0.248547  0.538937  0.566857  0.871744
3    0.250880  0.379846  0.386085  0.118023  0.294336
4    0.222510  0.584531  0.539939  0.561240  0.730273
..        ...       ...       ...       ...       ...
329  0.918440  0.399279  0.433333  0.704868  0.989346
330  0.556030  0.084405  0.090613  0.711683  0.300767
331  0.654916  0.802479  0.782623  0.834710  0.197150
332  0.058209  0.272884  0.930249  0.741329  0.575979
333  0.899464  0.949820  0.551696  0.006520  0.604493

[334 rows x 5 columns]

In [21]:
type(newdf)#return me the dataframe

pandas.core.frame.DataFrame

In [22]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.463464    0.511220    0.493253    0.519918    0.521753
std      0.281559    0.275978    0.288611    0.305880    0.281395
min      0.001413    0.001370    0.003445    0.002667    0.000971
25%      0.251627    0.286734    0.233541    0.255846    0.294546
50%      0.432943    0.523200    0.501255    0.528430    0.539450
75%      0.682064    0.759536    0.752942    0.805551    0.762757
max      0.997048    0.991909    0.999655    0.998985    0.998380

In [23]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [24]:
newdf.head()

          0         1         2         3         4
0  0.141125  0.613454  0.934262  0.351210  0.190514
1  0.076875  0.333627  0.696435  0.087534  0.325118
2  0.137903  0.248547  0.538937  0.566857  0.871744
3  0.250880  0.379846  0.386085  0.118023  0.294336
4  0.222510  0.584531  0.539939  0.561240  0.730273

In [25]:
newdf[0][0]="arman"#it show us that [0][0] is an object
newdf.dtypes

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_9400\3496854330.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0]="arman"#it show us that [0][0] is an object
C:\Users\Lenovo\AppData\Local\Temp\ipykernel_9400\3496854330.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'arman' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0]="arman"#it show us that [0][0] is an object

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [26]:
newdf.head()#it show[0][0] is arman

          0         1         2         3         4
0     arman  0.613454  0.934262  0.351210  0.190514
1  0.076875  0.333627  0.696435  0.087534  0.325118
2  0.137903  0.248547  0.538937  0.566857  0.871744
3   0.25088  0.379846  0.386085  0.118023  0.294336
4   0.22251  0.584531  0.539939  0.561240  0.730273

In [27]:
newdf.index#our data table is 0 to 334 so it show the all index 
#0 to 334

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [28]:
newdf.columns#it show the column number only

RangeIndex(start=0, stop=5, step=1)

In [29]:
#covert this dataframe in numpy array
newdf.to_numpy#create this into numpy

<bound method DataFrame.to_numpy of             0         1         2         3         4
0       arman  0.613454  0.934262  0.351210  0.190514
1    0.076875  0.333627  0.696435  0.087534  0.325118
2    0.137903  0.248547  0.538937  0.566857  0.871744
3     0.25088  0.379846  0.386085  0.118023  0.294336
4     0.22251  0.584531  0.539939  0.561240  0.730273
..        ...       ...       ...       ...       ...
329   0.91844  0.399279  0.433333  0.704868  0.989346
330   0.55603  0.084405  0.090613  0.711683  0.300767
331  0.654916  0.802479  0.782623  0.834710  0.197150
332  0.058209  0.272884  0.930249  0.741329  0.575979
333  0.899464  0.949820  0.551696  0.006520  0.604493

[334 rows x 5 columns]>

In [30]:
newdf[0][0]=0.3#above show it arman but we change that
newdf.head

<bound method NDFrame.head of             0         1         2         3         4
0         0.3  0.613454  0.934262  0.351210  0.190514
1    0.076875  0.333627  0.696435  0.087534  0.325118
2    0.137903  0.248547  0.538937  0.566857  0.871744
3     0.25088  0.379846  0.386085  0.118023  0.294336
4     0.22251  0.584531  0.539939  0.561240  0.730273
..        ...       ...       ...       ...       ...
329   0.91844  0.399279  0.433333  0.704868  0.989346
330   0.55603  0.084405  0.090613  0.711683  0.300767
331  0.654916  0.802479  0.782623  0.834710  0.197150
332  0.058209  0.272884  0.930249  0.741329  0.575979
333  0.899464  0.949820  0.551696  0.006520  0.604493

[334 rows x 5 columns]>

In [31]:
newdf.T#it turns row into columns and colmuns turns ito row

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.076875,0.137903,0.25088,0.22251,0.221273,0.609414,0.777077,0.019126,0.502195,...,0.509529,0.361445,0.304722,0.676757,0.086512,0.91844,0.55603,0.654916,0.058209,0.899464
1,0.613454,0.333627,0.248547,0.379846,0.584531,0.349103,0.852521,0.809496,0.873728,0.648688,...,0.805104,0.056892,0.991909,0.120593,0.753763,0.399279,0.084405,0.802479,0.272884,0.94982
2,0.934262,0.696435,0.538937,0.386085,0.539939,0.472335,0.351658,0.0714,0.025197,0.643233,...,0.356755,0.293594,0.118496,0.782594,0.107519,0.433333,0.090613,0.782623,0.930249,0.551696
3,0.35121,0.087534,0.566857,0.118023,0.56124,0.996149,0.004953,0.400085,0.973235,0.088359,...,0.093069,0.226901,0.224109,0.365698,0.673141,0.704868,0.711683,0.83471,0.741329,0.00652
4,0.190514,0.325118,0.871744,0.294336,0.730273,0.257363,0.378572,0.193119,0.960455,0.008154,...,0.814859,0.975985,0.67754,0.511294,0.112092,0.989346,0.300767,0.19715,0.575979,0.604493

In [32]:
#sort
newdf.head()

          0         1         2         3         4
0       0.3  0.613454  0.934262  0.351210  0.190514
1  0.076875  0.333627  0.696435  0.087534  0.325118
2  0.137903  0.248547  0.538937  0.566857  0.871744
3   0.25088  0.379846  0.386085  0.118023  0.294336
4   0.22251  0.584531  0.539939  0.561240  0.730273

In [33]:
#but we want to sort as index #axis=0 means it rows#ulta kore print korte means last index is first

newdf.sort_index(axis=0,ascending=False)

            0         1         2         3         4
333  0.899464  0.949820  0.551696  0.006520  0.604493
332  0.058209  0.272884  0.930249  0.741329  0.575979
331  0.654916  0.802479  0.782623  0.834710  0.197150
330   0.55603  0.084405  0.090613  0.711683  0.300767
329   0.91844  0.399279  0.433333  0.704868  0.989346
..        ...       ...       ...       ...       ...
4     0.22251  0.584531  0.539939  0.561240  0.730273
3     0.25088  0.379846  0.386085  0.118023  0.294336
2    0.137903  0.248547  0.538937  0.566857  0.871744
1    0.076875  0.333627  0.696435  0.087534  0.325118
0         0.3  0.613454  0.934262  0.351210  0.190514

[334 rows x 5 columns]

In [34]:
newdf.sort_index(axis=0,ascending=True)#its correct way to print#
#axis=0 it means row,axis=1 means it column

            0         1         2         3         4
0         0.3  0.613454  0.934262  0.351210  0.190514
1    0.076875  0.333627  0.696435  0.087534  0.325118
2    0.137903  0.248547  0.538937  0.566857  0.871744
3     0.25088  0.379846  0.386085  0.118023  0.294336
4     0.22251  0.584531  0.539939  0.561240  0.730273
..        ...       ...       ...       ...       ...
329   0.91844  0.399279  0.433333  0.704868  0.989346
330   0.55603  0.084405  0.090613  0.711683  0.300767
331  0.654916  0.802479  0.782623  0.834710  0.197150
332  0.058209  0.272884  0.930249  0.741329  0.575979
333  0.899464  0.949820  0.551696  0.006520  0.604493

[334 rows x 5 columns]

In [35]:
newdf.head()

          0         1         2         3         4
0       0.3  0.613454  0.934262  0.351210  0.190514
1  0.076875  0.333627  0.696435  0.087534  0.325118
2  0.137903  0.248547  0.538937  0.566857  0.871744
3   0.25088  0.379846  0.386085  0.118023  0.294336
4   0.22251  0.584531  0.539939  0.561240  0.730273

In [36]:
newdf[0]

0           0.3
1      0.076875
2      0.137903
3       0.25088
4       0.22251
         ...
329     0.91844
330     0.55603
331    0.654916
332    0.058209
333    0.899464
Name: 0, Length: 334, dtype: object

In [37]:
#we want to see this type it a series
type(newdf[0])

pandas.core.series.Series

In [38]:
newdf.head

<bound method NDFrame.head of             0         1         2         3         4
0         0.3  0.613454  0.934262  0.351210  0.190514
1    0.076875  0.333627  0.696435  0.087534  0.325118
2    0.137903  0.248547  0.538937  0.566857  0.871744
3     0.25088  0.379846  0.386085  0.118023  0.294336
4     0.22251  0.584531  0.539939  0.561240  0.730273
..        ...       ...       ...       ...       ...
329   0.91844  0.399279  0.433333  0.704868  0.989346
330   0.55603  0.084405  0.090613  0.711683  0.300767
331  0.654916  0.802479  0.782623  0.834710  0.197150
332  0.058209  0.272884  0.930249  0.741329  0.575979
333  0.899464  0.949820  0.551696  0.006520  0.604493

[334 rows x 5 columns]>

In [39]:
newdf2=newdf # it not copy it only poiter this numpy on newdf2 variable
newdf2

            0         1         2         3         4
0         0.3  0.613454  0.934262  0.351210  0.190514
1    0.076875  0.333627  0.696435  0.087534  0.325118
2    0.137903  0.248547  0.538937  0.566857  0.871744
3     0.25088  0.379846  0.386085  0.118023  0.294336
4     0.22251  0.584531  0.539939  0.561240  0.730273
..        ...       ...       ...       ...       ...
329   0.91844  0.399279  0.433333  0.704868  0.989346
330   0.55603  0.084405  0.090613  0.711683  0.300767
331  0.654916  0.802479  0.782623  0.834710  0.197150
332  0.058209  0.272884  0.930249  0.741329  0.575979
333  0.899464  0.949820  0.551696  0.006520  0.604493

[334 rows x 5 columns]

In [40]:
#value set in a specific index
newdf.loc[0,0]=654
newdf.head

<bound method NDFrame.head of             0         1         2         3         4
0         654  0.613454  0.934262  0.351210  0.190514
1    0.076875  0.333627  0.696435  0.087534  0.325118
2    0.137903  0.248547  0.538937  0.566857  0.871744
3     0.25088  0.379846  0.386085  0.118023  0.294336
4     0.22251  0.584531  0.539939  0.561240  0.730273
..        ...       ...       ...       ...       ...
329   0.91844  0.399279  0.433333  0.704868  0.989346
330   0.55603  0.084405  0.090613  0.711683  0.300767
331  0.654916  0.802479  0.782623  0.834710  0.197150
332  0.058209  0.272884  0.930249  0.741329  0.575979
333  0.899464  0.949820  0.551696  0.006520  0.604493

[334 rows x 5 columns]>

In [41]:
#create a new numpy using a pandas method dataframe
newdf2=newdf.copy()
newdf2[0][0]=97835
newdf

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_9400\2229203358.py:3: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][0]=97835
C:\Users\Lenovo\AppData\Local\Temp\ipykernel_9400\2229203358.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0]=97835

            0         1         2         3         4
0         654  0.613454  0.934262  0.351210  0.190514
1    0.076875  0.333627  0.696435  0.087534  0.325118
2    0.137903  0.248547  0.538937  0.566857  0.871744
3     0.25088  0.379846  0.386085  0.118023  0.294336
4     0.22251  0.584531  0.539939  0.561240  0.730273
..        ...       ...       ...       ...       ...
329   0.91844  0.399279  0.433333  0.704868  0.989346
330   0.55603  0.084405  0.090613  0.711683  0.300767
331  0.654916  0.802479  0.782623  0.834710  0.197150
332  0.058209  0.272884  0.930249  0.741329  0.575979
333  0.899464  0.949820  0.551696  0.006520  0.604493

[334 rows x 5 columns]

In [42]:
newdf2.head#print new df

<bound method NDFrame.head of             0         1         2         3         4
0       97835  0.613454  0.934262  0.351210  0.190514
1    0.076875  0.333627  0.696435  0.087534  0.325118
2    0.137903  0.248547  0.538937  0.566857  0.871744
3     0.25088  0.379846  0.386085  0.118023  0.294336
4     0.22251  0.584531  0.539939  0.561240  0.730273
..        ...       ...       ...       ...       ...
329   0.91844  0.399279  0.433333  0.704868  0.989346
330   0.55603  0.084405  0.090613  0.711683  0.300767
331  0.654916  0.802479  0.782623  0.834710  0.197150
332  0.058209  0.272884  0.930249  0.741329  0.575979
333  0.899464  0.949820  0.551696  0.006520  0.604493

[334 rows x 5 columns]>

In [43]:
newdf.loc[0,0]=654#0,0 position is 654
newdf.head(2)#show 2 column and row

          0         1         2         3         4
0       654  0.613454  0.934262  0.351210  0.190514
1  0.076875  0.333627  0.696435  0.087534  0.325118

In [44]:
newdf.columns= list("ABCDE")
newdf# column name is A B C D E

            A         B         C         D         E
0         654  0.613454  0.934262  0.351210  0.190514
1    0.076875  0.333627  0.696435  0.087534  0.325118
2    0.137903  0.248547  0.538937  0.566857  0.871744
3     0.25088  0.379846  0.386085  0.118023  0.294336
4     0.22251  0.584531  0.539939  0.561240  0.730273
..        ...       ...       ...       ...       ...
329   0.91844  0.399279  0.433333  0.704868  0.989346
330   0.55603  0.084405  0.090613  0.711683  0.300767
331  0.654916  0.802479  0.782623  0.834710  0.197150
332  0.058209  0.272884  0.930249  0.741329  0.575979
333  0.899464  0.949820  0.551696  0.006520  0.604493

[334 rows x 5 columns]

In [45]:
newdf.head(2)

          A         B         C         D         E
0       654  0.613454  0.934262  0.351210  0.190514
1  0.076875  0.333627  0.696435  0.087534  0.325118

In [46]:
newdf.loc[0,0]=654
newdf.head#it returns D first 654 and another value is nan nan nan
#but we want to do this

<bound method NDFrame.head of             A         B         C         D         E      0
0         654  0.613454  0.934262  0.351210  0.190514  654.0
1    0.076875  0.333627  0.696435  0.087534  0.325118    NaN
2    0.137903  0.248547  0.538937  0.566857  0.871744    NaN
3     0.25088  0.379846  0.386085  0.118023  0.294336    NaN
4     0.22251  0.584531  0.539939  0.561240  0.730273    NaN
..        ...       ...       ...       ...       ...    ...
329   0.91844  0.399279  0.433333  0.704868  0.989346    NaN
330   0.55603  0.084405  0.090613  0.711683  0.300767    NaN
331  0.654916  0.802479  0.782623  0.834710  0.197150    NaN
332  0.058209  0.272884  0.930249  0.741329  0.575979    NaN
333  0.899464  0.949820  0.551696  0.006520  0.604493    NaN

[334 rows x 6 columns]>

In [47]:
#to solve this we can write 
newdf.loc[0,'A']=65445
newdf.head()#now upgrade first value is 65445

          A         B         C         D         E      0
0     65445  0.613454  0.934262  0.351210  0.190514  654.0
1  0.076875  0.333627  0.696435  0.087534  0.325118    NaN
2  0.137903  0.248547  0.538937  0.566857  0.871744    NaN
3   0.25088  0.379846  0.386085  0.118023  0.294336    NaN
4   0.22251  0.584531  0.539939  0.561240  0.730273    NaN

In [48]:
#in above we want to drop last 0 column
newdf.drop(0,axis=1)
#axis 1 means column and axis 0 means is row

            A         B         C         D         E
0       65445  0.613454  0.934262  0.351210  0.190514
1    0.076875  0.333627  0.696435  0.087534  0.325118
2    0.137903  0.248547  0.538937  0.566857  0.871744
3     0.25088  0.379846  0.386085  0.118023  0.294336
4     0.22251  0.584531  0.539939  0.561240  0.730273
..        ...       ...       ...       ...       ...
329   0.91844  0.399279  0.433333  0.704868  0.989346
330   0.55603  0.084405  0.090613  0.711683  0.300767
331  0.654916  0.802479  0.782623  0.834710  0.197150
332  0.058209  0.272884  0.930249  0.741329  0.575979
333  0.899464  0.949820  0.551696  0.006520  0.604493

[334 rows x 5 columns]

In [49]:
newdf= newdf.drop(0,axis=1)
newdf.head()

          A         B         C         D         E
0     65445  0.613454  0.934262  0.351210  0.190514
1  0.076875  0.333627  0.696435  0.087534  0.325118
2  0.137903  0.248547  0.538937  0.566857  0.871744
3   0.25088  0.379846  0.386085  0.118023  0.294336
4   0.22251  0.584531  0.539939  0.561240  0.730273

In [50]:
#we want to demand set of column
newdf.loc[[1,2],['C','D']]
#1,2 row and c,D columns

          C         D
1  0.696435  0.087534
2  0.538937  0.566857

In [51]:
newdf.loc[[1,2], :]#it show 1 and 2 row and all column

          A         B         C         D         E
1  0.076875  0.333627  0.696435  0.087534  0.325118
2  0.137903  0.248547  0.538937  0.566857  0.871744

In [52]:
newdf.loc[(newdf['A']<0.3)&(newdf['C']>0.1)]

            A         B         C         D         E
1    0.076875  0.333627  0.696435  0.087534  0.325118
2    0.137903  0.248547  0.538937  0.566857  0.871744
3     0.25088  0.379846  0.386085  0.118023  0.294336
4     0.22251  0.584531  0.539939  0.561240  0.730273
5    0.221273  0.349103  0.472335  0.996149  0.257363
..        ...       ...       ...       ...       ...
317     0.081  0.787967  0.871982  0.679553  0.429759
321  0.112087  0.822335  0.938997  0.776026  0.068272
323  0.193309  0.518957  0.219258  0.432191  0.981018
328  0.086512  0.753763  0.107519  0.673141  0.112092
332  0.058209  0.272884  0.930249  0.741329  0.575979

[96 rows x 5 columns]

In [53]:
newdf.head(2)

          A         B         C         D         E
0     65445  0.613454  0.934262  0.351210  0.190514
1  0.076875  0.333627  0.696435  0.087534  0.325118

In [54]:
newdf.iloc[0,4]#its count 0 to 4 which value is 0.275744

np.float64(0.19051414607467831)

In [55]:
 newdf.iloc[[0.5],[1,2]]

          B         C
0  0.613454  0.934262

In [56]:
newdf.head(3)

          A         B         C         D         E
0     65445  0.613454  0.934262  0.351210  0.190514
1  0.076875  0.333627  0.696435  0.087534  0.325118
2  0.137903  0.248547  0.538937  0.566857  0.871744

In [57]:
#drop a column \\\

newdf.drop(['A','D'],axis=1)

            B         C         E
0    0.613454  0.934262  0.190514
1    0.333627  0.696435  0.325118
2    0.248547  0.538937  0.871744
3    0.379846  0.386085  0.294336
4    0.584531  0.539939  0.730273
..        ...       ...       ...
329  0.399279  0.433333  0.989346
330  0.084405  0.090613  0.300767
331  0.802479  0.782623  0.197150
332  0.272884  0.930249  0.575979
333  0.949820  0.551696  0.604493

[334 rows x 3 columns]